In [ ]:
import pandas as pd
from conexion import get_db_connection
# -----------------------------
# Conectarse a la base de datos
# -----------------------------
conn = get_db_connection()

# -----------------------------
# Leer la tabla raw_data
# -----------------------------
query = "SELECT * FROM raw_data"
df = pd.read_sql(query, conn,)


conn.close()
print("✅ Datos extraídos desde la base de datos")

C:\Users\Javo40\AppData\Local\Temp\ipykernel_24832\2301318833.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn,)

✅ Datos extraídos desde la base de datos

In [65]:
df.shape

(10000, 7)

In [66]:
df.columns

Index(['id', 'name', 'company_id', 'amount', 'status', 'created_at',
       'paid_at'],
      dtype='object')

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          9997 non-null   object
 1   name        9997 non-null   object
 2   company_id  9996 non-null   object
 3   amount      10000 non-null  object
 4   status      10000 non-null  object
 5   created_at  10000 non-null  object
 6   paid_at     6009 non-null   object
dtypes: object(7)
memory usage: 547.0+ KB

In [68]:
df.describe()

,id,name,company_id,amount,status,created_at,paid_at
count,9997,9997,9996,10000,10000,10000,6009
unique,9997,4,3,5771,10,143,140
top,48ba4bdbfb56ceebb32f2bd0263e759be942af3d,MiPasajefy,cbf1c8b09cd5b549416d49d220a40cbd317f952e,3.0,paid,2019-03-01,2019-02-27
freq,1,9899,9899,1980,5892,117,71

In [69]:
df['id'].unique()

array(['48ba4bdbfb56ceebb32f2bd0263e759be942af3d',
       '05fc6f5ac66b6ee7e4253aa5d0c2299eb47aaaf4',
       '2cdce231c1fc6a2061bfa2f1d978351fe217245d', ...,
       '50bb3950ecde94ca3e07853003a11a413508da36',
       '1b2c4e503a4a952064b70369cf8e72937c720474',
       '4e85c4eac968c9465fc8d34bcd4968ac019fa850'],
      shape=(9998,), dtype=object)

In [70]:
df['name'].unique()

array(['MiPasajefy', 'Muebles chidos', None, 'MiPas0xFFFF', 'MiP0xFFFF'],
      dtype=object)

In [71]:
df.isna().sum()

id               3
name             3
company_id       4
amount           0
status           0
created_at       0
paid_at       3991
dtype: int64

In [72]:
df.to_csv('raw_data_extracted.csv', index=False)